grevaillot/svd_tools/headers/STM32H7x5_CM7/flash.h
/** Flash_CCR1_CLR_CRCEND1 Bank 1 CRCEND1 flag clear bit **/
#define Flash_CCR1_CLR_CRCEND1		(1 << 27)
/** Flash_CCR1_CLR_DBECCERR1 Bank 1 DBECCERR1 flag clear bit **/
#define Flash_CCR1_CLR_DBECCERR1		(1 << 26)
/** Flash_CCR1_CLR_SNECCERR1 Bank 1 SNECCERR1 flag clear bit **/
#define Flash_CCR1_CLR_SNECCERR1		(1 << 25)
/** Flash_CCR1_CLR_RDSERR1 Bank 1 RDSERR1 flag clear bit **/
#define Flash_CCR1_CLR_RDSERR1		(1 << 24)
/** Flash_CCR1_CLR_RDPERR1 Bank 1 RDPERR1 flag clear bit **/
#define Flash_CCR1_CLR_RDPERR1		(1 << 23)
/** Flash_CCR1_CLR_OPERR1 Bank 1 OPERR1 flag clear bit **/
#define Flash_CCR1_CLR_OPERR1		(1 << 22)
/** Flash_CCR1_CLR_INCERR1 Bank 1 INCERR1 flag clear bit **/
#define Flash_CCR1_CLR_INCERR1		(1 << 21)
/** Flash_CCR1_CLR_STRBERR1 Bank 1 STRBERR1 flag clear bit **/
#define Flash_CCR1_CLR_STRBERR1		(1 << 19)
/** Flash_CCR1_CLR_PGSERR1 Bank 1 PGSERR1 flag clear bi **/
#define Flash_CCR1_CLR_PGSERR1		(1 << 18)
/** Flash_CCR1_CLR_WRPERR1 Bank 1 WRPERR1 flag clear bit **/
#define Flash_CCR1_CLR_WRPERR1		(1 << 17)
/** Flash_CCR1_CLR_EOP1 Bank 1 EOP1 flag clear bit **/
#define Flash_CCR1_CLR_EOP1		(1 << 16)

/**@}*/

/** @defgroup flash_optcr OPTCR FLASH option control register
@{*/

/** Flash_OPTCR_SWAP_BANK Bank swapping configuration bit **/
#define Flash_OPTCR_SWAP_BANK		(1 << 31)
/** Flash_OPTCR_OPTCHANGEERRIE Option byte change error interrupt enable bit **/
#define Flash_OPTCR_OPTCHANGEERRIE		(1 << 30)
/** Flash_OPTCR_MER Flash mass erase enable bit **/
#define Flash_OPTCR_MER		(1 << 4)
/** Flash_OPTCR_OPTSTART Option byte start change option configuration bit **/
#define Flash_OPTCR_OPTSTART		(1 << 1)
/** Flash_OPTCR_OPTLOCK FLASH_OPTCR lock option configuration bit **/
#define Flash_OPTCR_OPTLOCK		(1 << 0)

/**@}*/

/** @defgroup flash_optsr_cur OPTSRCUR FLASH option status register
@{*/

/** Flash_OPTSR_CUR_SWAP_BANK_OPT Bank swapping option status bit **/
#define Flash_OPTSR_CUR_SWAP_BANK_OPT		(1 << 31)
/** Flash_OPTSR_CUR_OPTCHANGEERR Option byte change error flag **/
#define Flash_OPTSR_CUR_OPTCHANGEERR		(1 << 30)
/** Flash_OPTSR_CUR_IO_HSLV I/O high-speed at low-voltage status bit (PRODUCT_BELOW_25V) **/
#define Flash_OPTSR_CUR_IO_HSLV		(1 << 29)
/** Flash_OPTSR_CUR_PERSO_OK Device personalization status bit **/
#define Flash_OPTSR_CUR_PERSO_OK		(1 << 28)
/** Flash_OPTSR_CUR_RSS1 User option bit 1 **/
#define Flash_OPTSR_CUR_RSS1		(1 << 26)
/** Flash_OPTSR_CUR_SECURITY Security enable option status bit **/
#define Flash_OPTSR_CUR_SECURITY		(1 << 21)

#define Flash_OPTSR_CUR_ST_RAM_SIZE_SHIFT		19
#define Flash_OPTSR_CUR_ST_RAM_SIZE_MASK		0x03
/** @defgroup flash_optsr_cur_st_ram_size STRAMSIZE DTCM RAM size option status
@{*/
/**@}*/

/** Flash_OPTSR_CUR_FZ_IWDG_SDBY IWDG Standby mode freeze option status bit **/
#define Flash_OPTSR_CUR_FZ_IWDG_SDBY		(1 << 18)
/** Flash_OPTSR_CUR_FZ_IWDG_STOP IWDG Stop mode freeze option status bit **/
#define Flash_OPTSR_CUR_FZ_IWDG_STOP		(1 << 17)

#define Flash_OPTSR_CUR_RDP_SHIFT		8
#define Flash_OPTSR_CUR_RDP_MASK		0xff
/** @defgroup flash_optsr_cur_rdp RDP Readout protection level option status byte
@{*/
/**@}*/

/** Flash_OPTSR_CUR_nRST_STBY_D1 D1 DStandby entry reset option status bit **/
#define Flash_OPTSR_CUR_nRST_STBY_D1		(1 << 7)
/** Flash_OPTSR_CUR_nRST_STOP_D1 D1 DStop entry reset option status bit **/
#define Flash_OPTSR_CUR_nRST_STOP_D1		(1 << 6)
/** Flash_OPTSR_CUR_IWDG1_HW IWDG1 control option status bit **/
#define Flash_OPTSR_CUR_IWDG1_HW		(1 << 4)

#define Flash_OPTSR_CUR_BOR_LEV_SHIFT		2
#define Flash_OPTSR_CUR_BOR_LEV_MASK		0x03
/** @defgroup flash_optsr_cur_bor_lev BORLEV Brownout level option status bit
@{*/
/**@}*/

/** Flash_OPTSR_CUR_OPT_BUSY Option byte change ongoing flag **/
#define Flash_OPTSR_CUR_OPT_BUSY		(1 << 0)

/**@}*/

/** @defgroup flash_optsr_prg OPTSRPRG FLASH option status register
@{*/

/** Flash_OPTSR_PRG_SWAP_BANK_OPT Bank swapping option configuration bit **/
#define Flash_OPTSR_PRG_SWAP_BANK_OPT		(1 << 31)
/** Flash_OPTSR_PRG_IO_HSLV I/O high-speed at low-voltage (PRODUCT_BELOW_25V) **/
#define Flash_OPTSR_PRG_IO_HSLV		(1 << 29)
/** Flash_OPTSR_PRG_RSS2 User option configuration bit 2 **/
#define Flash_OPTSR_PRG_RSS2		(1 << 27)
/** Flash_OPTSR_PRG_RSS1 User option configuration bit 1 **/
#define Flash_OPTSR_PRG_RSS1		(1 << 26)
/** Flash_OPTSR_PRG_SECURITY Security option configuration bit **/
#define Flash_OPTSR_PRG_SECURITY		(1 << 21)

#define Flash_OPTSR_PRG_ST_RAM_SIZE_SHIFT		19
#define Flash_OPTSR_PRG_ST_RAM_SIZE_MASK		0x03
/** @defgroup flash_optsr_prg_st_ram_size STRAMSIZE DTCM size select option configuration bits
@{*/
/**@}*/

/** Flash_OPTSR_PRG_FZ_IWDG_SDBY IWDG Standby mode freeze option configuration bit **/
#define Flash_OPTSR_PRG_FZ_IWDG_SDBY		(1 << 18)
/** Flash_OPTSR_PRG_FZ_IWDG_STOP IWDG Stop mode freeze option configuration bit **/
#define Flash_OPTSR_PRG_FZ_IWDG_STOP		(1 << 17)

#define Flash_OPTSR_PRG_RDP_SHIFT		8
#define Flash_OPTSR_PRG_RDP_MASK		0xff
/** @defgroup flash_optsr_prg_rdp RDP Readout protection level option configuration byte
@{*/
/**@}*/

/** Flash_OPTSR_PRG_nRST_STBY_D1 Option byte erase after D1 DStandby option configuration bit **/
#define Flash_OPTSR_PRG_nRST_STBY_D1		(1 << 7)
/** Flash_OPTSR_PRG_nRST_STOP_D1 Option byte erase after D1 DStop option configuration bit **/
#define Flash_OPTSR_PRG_nRST_STOP_D1		(1 << 6)
/** Flash_OPTSR_PRG_IWDG1_HW IWDG1 option configuration bit **/
#define Flash_OPTSR_PRG_IWDG1_HW		(1 << 4)

#define Flash_OPTSR_PRG_BOR_LEV_SHIFT		2
#define Flash_OPTSR_PRG_BOR_LEV_MASK		0x03
/** @defgroup flash_optsr_prg_bor_lev BORLEV BOR reset level option configuration bits
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_optccr OPTCCR FLASH option clear control register
@{*/

/** Flash_OPTCCR_CLR_OPTCHANGEERR OPTCHANGEERR reset bit **/
#define Flash_OPTCCR_CLR_OPTCHANGEERR		(1 << 30)

/**@}*/

/** @defgroup flash_prar_cur1 PRARCUR1 FLASH protection address for bank 1
@{*/

/** Flash_PRAR_CUR1_DMEP1 Bank 1 PCROP protected erase enable option status bit **/
#define Flash_PRAR_CUR1_DMEP1		(1 << 31)

#define Flash_PRAR_CUR1_PROT_AREA_END1_SHIFT		16
#define Flash_PRAR_CUR1_PROT_AREA_END1_MASK		0xfff
/** @defgroup flash_prar_cur1_prot_area_end1 PROTAREAEND1 Bank 1 highest PCROP protected address
@{*/
/**@}*/


#define Flash_PRAR_CUR1_PROT_AREA_START1_SHIFT		0
#define Flash_PRAR_CUR1_PROT_AREA_START1_MASK		0xfff
/** @defgroup flash_prar_cur1_prot_area_start1 PROTAREASTART1 Bank 1 lowest PCROP protected address
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_prar_prg1 PRARPRG1 FLASH protection address for bank 1
@{*/

