grevaillot/svd_tools/headers/STM32H7x5_CM7/flash.h
/** Flash_PRAR_PRG1_DMEP1 Bank 1 PCROP protected erase enable option configuration bit **/
#define Flash_PRAR_PRG1_DMEP1		(1 << 31)

#define Flash_PRAR_PRG1_PROT_AREA_END1_SHIFT		16
#define Flash_PRAR_PRG1_PROT_AREA_END1_MASK		0xfff
/** @defgroup flash_prar_prg1_prot_area_end1 PROTAREAEND1 Bank 1 highest PCROP protected address configuration
@{*/
/**@}*/


#define Flash_PRAR_PRG1_PROT_AREA_START1_SHIFT		0
#define Flash_PRAR_PRG1_PROT_AREA_START1_MASK		0xfff
/** @defgroup flash_prar_prg1_prot_area_start1 PROTAREASTART1 Bank 1 lowest PCROP protected address configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_prar_prg2 PRARPRG2 FLASH protection address for bank 2
@{*/

/** Flash_PRAR_PRG2_DMEP2 Bank 2 PCROP protected erase enable option configuration bit **/
#define Flash_PRAR_PRG2_DMEP2		(1 << 31)

#define Flash_PRAR_PRG2_PROT_AREA_END2_SHIFT		16
#define Flash_PRAR_PRG2_PROT_AREA_END2_MASK		0xfff
/** @defgroup flash_prar_prg2_prot_area_end2 PROTAREAEND2 Bank 2 highest PCROP protected address configuration
@{*/
/**@}*/


#define Flash_PRAR_PRG2_PROT_AREA_START2_SHIFT		0
#define Flash_PRAR_PRG2_PROT_AREA_START2_MASK		0xfff
/** @defgroup flash_prar_prg2_prot_area_start2 PROTAREASTART2 Bank 2 lowest PCROP protected address configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_scar_cur1 SCARCUR1 FLASH secure address for bank 1
@{*/

/** Flash_SCAR_CUR1_DMES1 Bank 1 secure protected erase enable option status bit **/
#define Flash_SCAR_CUR1_DMES1		(1 << 31)

#define Flash_SCAR_CUR1_SEC_AREA_END1_SHIFT		16
#define Flash_SCAR_CUR1_SEC_AREA_END1_MASK		0xfff
/** @defgroup flash_scar_cur1_sec_area_end1 SECAREAEND1 Bank 1 highest secure protected address
@{*/
/**@}*/


#define Flash_SCAR_CUR1_SEC_AREA_START1_SHIFT		0
#define Flash_SCAR_CUR1_SEC_AREA_START1_MASK		0xfff
/** @defgroup flash_scar_cur1_sec_area_start1 SECAREASTART1 Bank 1 lowest secure protected address
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_scar_prg1 SCARPRG1 FLASH secure address for bank 1
@{*/

/** Flash_SCAR_PRG1_DMES1 Bank 1 secure protected erase enable option configuration bit **/
#define Flash_SCAR_PRG1_DMES1		(1 << 31)

#define Flash_SCAR_PRG1_SEC_AREA_END1_SHIFT		16
#define Flash_SCAR_PRG1_SEC_AREA_END1_MASK		0xfff
/** @defgroup flash_scar_prg1_sec_area_end1 SECAREAEND1 Bank 1 highest secure protected address configuration
@{*/
/**@}*/


#define Flash_SCAR_PRG1_SEC_AREA_START1_SHIFT		0
#define Flash_SCAR_PRG1_SEC_AREA_START1_MASK		0xfff
/** @defgroup flash_scar_prg1_sec_area_start1 SECAREASTART1 Bank 1 lowest secure protected address configuration
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_wpsn_cur1r WPSNCUR1R FLASH write sector protection for bank 1
@{*/


#define Flash_WPSN_CUR1R_WRPSn1_SHIFT		0
#define Flash_WPSN_CUR1R_WRPSn1_MASK		0xff
/** @defgroup flash_wpsn_cur1r_wrpsn1 WRPSn1 Bank 1 sector write protection option status byte
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_wpsn_prg1r WPSNPRG1R FLASH write sector protection for bank 1
@{*/


#define Flash_WPSN_PRG1R_WRPSn1_SHIFT		0
#define Flash_WPSN_PRG1R_WRPSn1_MASK		0xff
/** @defgroup flash_wpsn_prg1r_wrpsn1 WRPSn1 Bank 1 sector write protection configuration byte
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_boot_curr BOOTCURR FLASH register with boot address
@{*/


#define Flash_BOOT_CURR_BOOT_ADD1_SHIFT		16
#define Flash_BOOT_CURR_BOOT_ADD1_MASK		0xffff
/** @defgroup flash_boot_curr_boot_add1 BOOTADD1 Boot address 1
@{*/
/**@}*/


#define Flash_BOOT_CURR_BOOT_ADD0_SHIFT		0
#define Flash_BOOT_CURR_BOOT_ADD0_MASK		0xffff
/** @defgroup flash_boot_curr_boot_add0 BOOTADD0 Boot address 0
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_boot_prgr BOOTPRGR FLASH register with boot address
@{*/


#define Flash_BOOT_PRGR_BOOT_ADD1_SHIFT		16
#define Flash_BOOT_PRGR_BOOT_ADD1_MASK		0xffff
/** @defgroup flash_boot_prgr_boot_add1 BOOTADD1 Boot address 1
@{*/
/**@}*/


#define Flash_BOOT_PRGR_BOOT_ADD0_SHIFT		0
#define Flash_BOOT_PRGR_BOOT_ADD0_MASK		0xffff
/** @defgroup flash_boot_prgr_boot_add0 BOOTADD0 Boot address 0
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crccr1 CRCCR1 FLASH CRC control register for bank 1
@{*/


#define Flash_CRCCR1_CRC_BURST_SHIFT		20
#define Flash_CRCCR1_CRC_BURST_MASK		0x03
/** @defgroup flash_crccr1_crc_burst CRCBURST Bank 1 CRC burst size
@{*/
/**@}*/

/** Flash_CRCCR1_CLEAN_CRC Bank 1 CRC clear bit **/
#define Flash_CRCCR1_CLEAN_CRC		(1 << 17)
/** Flash_CRCCR1_START_CRC Bank 1 CRC start bit **/
#define Flash_CRCCR1_START_CRC		(1 << 16)
/** Flash_CRCCR1_CLEAN_SECT Bank 1 CRC sector list clear bit **/
#define Flash_CRCCR1_CLEAN_SECT		(1 << 10)
/** Flash_CRCCR1_ADD_SECT Bank 1 CRC sector select bit **/
#define Flash_CRCCR1_ADD_SECT		(1 << 9)
/** Flash_CRCCR1_CRC_BY_SECT Bank 1 CRC sector mode select bit **/
#define Flash_CRCCR1_CRC_BY_SECT		(1 << 8)
/** Flash_CRCCR1_ALL_BANK Bank 1 CRC select bit **/
#define Flash_CRCCR1_ALL_BANK		(1 << 7)

#define Flash_CRCCR1_CRC_SECT_SHIFT		0
#define Flash_CRCCR1_CRC_SECT_MASK		0x07
/** @defgroup flash_crccr1_crc_sect CRCSECT Bank 1 CRC sector number
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crcsadd1r CRCSADD1R FLASH CRC start address register for bank 1
@{*/


#define Flash_CRCSADD1R_CRC_START_ADDR_SHIFT		0
#define Flash_CRCSADD1R_CRC_START_ADDR_MASK		0xffffffff
/** @defgroup flash_crcsadd1r_crc_start_addr CRCSTARTADDR CRC start address on bank 1
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crceadd1r CRCEADD1R FLASH CRC end address register for bank 1
@{*/


#define Flash_CRCEADD1R_CRC_END_ADDR_SHIFT		0
#define Flash_CRCEADD1R_CRC_END_ADDR_MASK		0xffffffff
/** @defgroup flash_crceadd1r_crc_end_addr CRCENDADDR CRC end address on bank 1
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_crcdatar CRCDATAR FLASH CRC data register
@{*/


#define Flash_CRCDATAR_CRC_DATA_SHIFT		0
#define Flash_CRCDATAR_CRC_DATA_MASK		0xffffffff
/** @defgroup flash_crcdatar_crc_data CRCDATA CRC result
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_ecc_fa1r ECCFA1R FLASH ECC fail address for bank 1
@{*/


#define Flash_ECC_FA1R_FAIL_ECC_ADDR1_SHIFT		0
#define Flash_ECC_FA1R_FAIL_ECC_ADDR1_MASK		0x7fff
/** @defgroup flash_ecc_fa1r_fail_ecc_addr1 FAILECCADDR1 Bank 1 ECC error address
@{*/
/**@}*/


/**@}*/

