grevaillot/svd_tools/headers/STM32H7x5_CM7/flash.h
/** @defgroup flash_acr_ ACR Access control register
@{*/


#define Flash_ACR__WRHIGHFREQ_SHIFT		4
#define Flash_ACR__WRHIGHFREQ_MASK		0x03
/** @defgroup flash_acr__wrhighfreq WRHIGHFREQ Flash signal delay
@{*/
/**@}*/


#define Flash_ACR__LATENCY_SHIFT		0
#define Flash_ACR__LATENCY_MASK		0x07
/** @defgroup flash_acr__latency LATENCY Read latency
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_keyr2 KEYR2 FLASH key register for bank 2
@{*/


#define Flash_KEYR2_KEYR2_SHIFT		0
#define Flash_KEYR2_KEYR2_MASK		0xffffffff
/** @defgroup flash_keyr2_keyr2 KEYR2 Bank 2 access configuration unlock key
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_optkeyr_ OPTKEYR FLASH option key register
@{*/


#define Flash_OPTKEYR__OPTKEYR_SHIFT		0
#define Flash_OPTKEYR__OPTKEYR_MASK		0xffffffff
/** @defgroup flash_optkeyr__optkeyr OPTKEYR Unlock key option bytes
@{*/
/**@}*/


/**@}*/

/** @defgroup flash_cr2 CR2 FLASH control register for bank 2
@{*/

/** Flash_CR2_CRCENDIE2 Bank 2 end of CRC calculation interrupt enable bit **/
#define Flash_CR2_CRCENDIE2		(1 << 27)
/** Flash_CR2_DBECCERRIE2 Bank 2 ECC double detection error interrupt enable bit **/
#define Flash_CR2_DBECCERRIE2		(1 << 26)
/** Flash_CR2_SNECCERRIE2 Bank 2 ECC single correction error interrupt enable bit **/
#define Flash_CR2_SNECCERRIE2		(1 << 25)
/** Flash_CR2_RDSERRIE2 Bank 2 secure error interrupt enable bit **/
#define Flash_CR2_RDSERRIE2		(1 << 24)
/** Flash_CR2_RDPERRIE2 Bank 2 read protection error interrupt enable bit **/
#define Flash_CR2_RDPERRIE2		(1 << 23)
/** Flash_CR2_OPERRIE2 Bank 2 write/erase error interrupt enable bit **/
#define Flash_CR2_OPERRIE2		(1 << 22)
/** Flash_CR2_INCERRIE2 Bank 2 inconsistency error interrupt enable bit **/
#define Flash_CR2_INCERRIE2		(1 << 21)
/** Flash_CR2_STRBERRIE2 Bank 2 strobe error interrupt enable bit **/
#define Flash_CR2_STRBERRIE2		(1 << 19)
/** Flash_CR2_PGSERRIE2 Bank 2 programming sequence error interrupt enable bit **/
#define Flash_CR2_PGSERRIE2		(1 << 18)
/** Flash_CR2_WRPERRIE2 Bank 2 write protection error interrupt enable bit **/
#define Flash_CR2_WRPERRIE2		(1 << 17)
/** Flash_CR2_EOPIE2 Bank 2 end-of-program interrupt control bit **/
#define Flash_CR2_EOPIE2		(1 << 16)
/** Flash_CR2_CRC_EN Bank 2 CRC control bit **/
#define Flash_CR2_CRC_EN		(1 << 15)

#define Flash_CR2_SNB2_SHIFT		8
#define Flash_CR2_SNB2_MASK		0x07
/** @defgroup flash_cr2_snb2 SNB2 Bank 2 sector erase selection number
@{*/
/**@}*/

/** Flash_CR2_START2 Bank 2 bank or sector erase start control bit **/
#define Flash_CR2_START2		(1 << 7)
/** Flash_CR2_FW2 Bank 2 write forcing control bit **/
#define Flash_CR2_FW2		(1 << 6)

#define Flash_CR2_PSIZE2_SHIFT		4
#define Flash_CR2_PSIZE2_MASK		0x03
/** @defgroup flash_cr2_psize2 PSIZE2 Bank 2 program size
@{*/
/**@}*/

/** Flash_CR2_BER2 Bank 2 erase request **/
#define Flash_CR2_BER2		(1 << 3)
/** Flash_CR2_SER2 Bank 2 sector erase request **/
#define Flash_CR2_SER2		(1 << 2)
/** Flash_CR2_PG2 Bank 2 program enable bit **/
#define Flash_CR2_PG2		(1 << 1)
/** Flash_CR2_LOCK2 Bank 2 configuration lock bit **/
#define Flash_CR2_LOCK2		(1 << 0)

/**@}*/

/** @defgroup flash_sr2 SR2 FLASH status register for bank 2
@{*/

/** Flash_SR2_CRCEND2 Bank 2 CRC-complete flag **/
#define Flash_SR2_CRCEND2		(1 << 27)
/** Flash_SR2_DBECCERR2 Bank 2 ECC double detection error flag **/
#define Flash_SR2_DBECCERR2		(1 << 26)
/** Flash_SR2_SNECCERR2 Bank 2 single correction error flag **/
#define Flash_SR2_SNECCERR2		(1 << 25)
/** Flash_SR2_RDSERR2 Bank 2 secure error flag **/
#define Flash_SR2_RDSERR2		(1 << 24)
/** Flash_SR2_RDPERR2 Bank 2 read protection error flag **/
#define Flash_SR2_RDPERR2		(1 << 23)
/** Flash_SR2_OPERR2 Bank 2 write/erase error flag **/
#define Flash_SR2_OPERR2		(1 << 22)
/** Flash_SR2_INCERR2 Bank 2 inconsistency error flag **/
#define Flash_SR2_INCERR2		(1 << 21)
/** Flash_SR2_STRBERR2 Bank 2 strobe error flag **/
#define Flash_SR2_STRBERR2		(1 << 19)
/** Flash_SR2_PGSERR2 Bank 2 programming sequence error flag **/
#define Flash_SR2_PGSERR2		(1 << 18)
/** Flash_SR2_WRPERR2 Bank 2 write protection error flag **/
#define Flash_SR2_WRPERR2		(1 << 17)
/** Flash_SR2_EOP2 Bank 2 end-of-program flag **/
#define Flash_SR2_EOP2		(1 << 16)
/** Flash_SR2_CRC_BUSY2 Bank 2 CRC busy flag **/
#define Flash_SR2_CRC_BUSY2		(1 << 3)
/** Flash_SR2_QW2 Bank 2 wait queue flag **/
#define Flash_SR2_QW2		(1 << 2)
/** Flash_SR2_WBNE2 Bank 2 write buffer not empty flag **/
#define Flash_SR2_WBNE2		(1 << 1)
/** Flash_SR2_BSY2 Bank 2 ongoing program flag **/
#define Flash_SR2_BSY2		(1 << 0)

/**@}*/

/** @defgroup flash_ccr2 CCR2 FLASH clear control register for bank 2
@{*/

/** Flash_CCR2_CLR_CRCEND2 Bank 2 CRCEND1 flag clear bit **/
#define Flash_CCR2_CLR_CRCEND2		(1 << 27)
/** Flash_CCR2_CLR_DBECCERR1 Bank 1 DBECCERR1 flag clear bit **/
#define Flash_CCR2_CLR_DBECCERR1		(1 << 26)
/** Flash_CCR2_CLR_SNECCERR2 Bank 2 SNECCERR1 flag clear bit **/
#define Flash_CCR2_CLR_SNECCERR2		(1 << 25)
/** Flash_CCR2_CLR_RDSERR1 Bank 1 RDSERR1 flag clear bit **/
#define Flash_CCR2_CLR_RDSERR1		(1 << 24)
/** Flash_CCR2_CLR_RDPERR2 Bank 2 RDPERR1 flag clear bit **/
#define Flash_CCR2_CLR_RDPERR2		(1 << 23)
/** Flash_CCR2_CLR_OPERR2 Bank 2 OPERR1 flag clear bit **/
#define Flash_CCR2_CLR_OPERR2		(1 << 22)
/** Flash_CCR2_CLR_INCERR2 Bank 2 INCERR1 flag clear bit **/
#define Flash_CCR2_CLR_INCERR2		(1 << 21)
/** Flash_CCR2_CLR_STRBERR2 Bank 2 STRBERR1 flag clear bit **/
#define Flash_CCR2_CLR_STRBERR2		(1 << 19)
/** Flash_CCR2_CLR_PGSERR2 Bank 2 PGSERR1 flag clear bi **/
#define Flash_CCR2_CLR_PGSERR2		(1 << 18)
/** Flash_CCR2_CLR_WRPERR2 Bank 2 WRPERR1 flag clear bit **/
#define Flash_CCR2_CLR_WRPERR2		(1 << 17)
/** Flash_CCR2_CLR_EOP2 Bank 1 EOP1 flag clear bit **/
#define Flash_CCR2_CLR_EOP2		(1 << 16)

/**@}*/

/** @defgroup flash_optcr_ OPTCR FLASH option control register
@{*/

/** Flash_OPTCR__SWAP_BANK Bank swapping configuration bit **/
#define Flash_OPTCR__SWAP_BANK		(1 << 31)
/** Flash_OPTCR__OPTCHANGEERRIE Option byte change error interrupt enable bit **/
#define Flash_OPTCR__OPTCHANGEERRIE		(1 << 30)
/** Flash_OPTCR__MER Flash mass erase enable bit **/
#define Flash_OPTCR__MER		(1 << 4)
/** Flash_OPTCR__OPTSTART Option byte start change option configuration bit **/
#define Flash_OPTCR__OPTSTART		(1 << 1)
/** Flash_OPTCR__OPTLOCK FLASH_OPTCR lock option configuration bit **/
#define Flash_OPTCR__OPTLOCK		(1 << 0)

/**@}*/

/** @defgroup flash_optsr_cur_ OPTSRCUR FLASH option status register
@{*/

/** Flash_OPTSR_CUR__SWAP_BANK_OPT Bank swapping option status bit **/
#define Flash_OPTSR_CUR__SWAP_BANK_OPT		(1 << 31)
/** Flash_OPTSR_CUR__OPTCHANGEERR Option byte change error flag **/
#define Flash_OPTSR_CUR__OPTCHANGEERR		(1 << 30)
/** Flash_OPTSR_CUR__IO_HSLV I/O high-speed at low-voltage status bit (PRODUCT_BELOW_25V) **/
#define Flash_OPTSR_CUR__IO_HSLV		(1 << 29)
/** Flash_OPTSR_CUR__PERSO_OK Device personalization status bit **/
#define Flash_OPTSR_CUR__PERSO_OK		(1 << 28)
/** Flash_OPTSR_CUR__RSS1 User option bit 1 **/
#define Flash_OPTSR_CUR__RSS1		(1 << 26)
/** Flash_OPTSR_CUR__SECURITY Security enable option status bit **/
#define Flash_OPTSR_CUR__SECURITY		(1 << 21)

#define Flash_OPTSR_CUR__ST_RAM_SIZE_SHIFT		19
#define Flash_OPTSR_CUR__ST_RAM_SIZE_MASK		0x03
/** @defgroup flash_optsr_cur__st_ram_size STRAMSIZE DTCM RAM size option status
@{*/
/**@}*/

